{
  "CopilotChat.nvim": { "branch": "canary" },
  "DidYouMean": { "branch": "master" },
  "FlyGrep.vim": { "branch": "master" },
  "FoldText": { "branch": "master" },
  "LazyVim": { "branch": "main" },
  "LuaSnip": { "branch": "master" },
  "Luinnar": { "branch": "master" },
  "SchemaStore.nvim": { "branch": "main" },
  "Zenburn": { "branch": "master" },
  "bluloco.nvim": { "branch": "main" },
  "bufexplorer": { "branch": "master" },
  "bufferline.nvim": { "branch": "main" },
  "bufjump.nvim": { "branch": "master" },
  "bufresize.nvim": { "branch": "master" },
  "build123d-OCP.code-snippets": { "branch": "main" },
  "bullets.vim": { "branch": "master" },
  "camelcasemotion": { "branch": "master" },
  "catppuccin": { "branch": "main" },
  "cheatsheet.nvim": { "branch": "master" },
  "cmd-parser.nvim": { "branch": "master" },
  "cmdpalette.nvim": { "branch": "main" },
  "cmp-buffer": { "branch": "main" },
  "cmp-dap": { "branch": "master" },
  "cmp-nvim-lsp": { "branch": "main" },
  "cmp-nvim-lsp-document-symbol": { "branch": "main" },
  "cmp-nvim-lsp-signature-help": { "branch": "main" },
  "cmp-path": { "branch": "main" },
  "cmp-spell": { "branch": "master" },
  "cmp_luasnip": { "branch": "master" },
  "cobalt2-vim-theme": { "branch": "master" },
  "command_center.nvim": { "branch": "main" },
  "compiler.nvim": { "branch": "main" },
  "conform.nvim": { "branch": "master" },
  "copilot-cmp": { "branch": "master" },
  "copilot.lua": { "branch": "master" },
  "crates.nvim": { "branch": "main" },
  "dial.nvim": { "branch": "master" },
  "diffview.nvim": { "branch": "main" },
  "direnv.vim": { "branch": "master" },
  "dracula": { "branch": "master" },
  "dressing.nvim": { "branch": "master" },
  "eyeliner.nvim": { "branch": "main" },
  "firenvim": { "branch": "master" },
  "friendly-snippets": { "branch": "main" },
  "fzf": { "branch": "master" },
  "fzf.vim": { "branch": "master" },
  "git-messenger.vim": { "branch": "master" },
  "gitsigns.nvim": { "branch": "main" },
  "goto-breakpoints.nvim": { "branch": "master" },
  "goyo.vim": { "branch": "master" },
  "graphviz.vim": { "branch": "master" },
  "grug-far.nvim": { "branch": "main" },
  "gruvbox.nvim": { "branch": "main" },
  "guess-indent.nvim": { "branch": "main" },
  "gv.vim": { "branch": "master" },
  "gx.nvim": { "branch": "main" },
  "harpoon": { "branch": "harpoon2" },
  "highlight-undo.nvim": { "branch": "main" },
  "indent-blankline.nvim": { "branch": "master" },
  "inspired-github.vim": { "branch": "main" },
  "investigate.vim": { "branch": "master" },
  "jellybeans.vim": { "branch": "master" },
  "jupytext.nvim": { "branch": "main" },
  "kmonad-vim": { "branch": "master" },
  "kuroi.vim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lazydev.nvim": { "branch": "main" },
  "leap-spooky.nvim": { "branch": "main" },
  "leap.nvim": { "branch": "main" },
  "lessspace.vim": { "branch": "master" },
  "limelight.vim": { "branch": "master" },
  "linediff.vim": { "branch": "main" },
  "lsp-colors.nvim": { "branch": "main" },
  "lualine.nvim": { "branch": "master" },
  "luvit-meta": { "branch": "main" },
  "markdown-preview.nvim": { "branch": "master" },
  "mason-lspconfig.nvim": { "branch": "main" },
  "mason-nvim-dap.nvim": { "branch": "main" },
  "mason-tool-installer.nvim": { "branch": "main" },
  "mason.nvim": { "branch": "main" },
  "md-img-paste.vim": { "branch": "master" },
  "mini.ai": { "branch": "main" },
  "mini.align": { "branch": "main" },
  "mini.icons": { "branch": "main" },
  "mkdx": { "branch": "master" },
  "molokai": { "branch": "master" },
  "neo-tree.nvim": { "branch": "main" },
  "neoformat": { "branch": "master" },
  "neogen": { "branch": "main" },
  "neogit": { "branch": "master" },
  "neoterm": { "branch": "master" },
  "neotest": { "branch": "master" },
  "neovim-ayu": { "branch": "master" },
  "nui.nvim": { "branch": "main" },
  "nvim-cmp": { "branch": "main" },
  "nvim-colorizer.lua": { "branch": "master" },
  "nvim-dap": { "branch": "master" },
  "nvim-dap-python": { "branch": "master" },
  "nvim-dap-ui": { "branch": "master" },
  "nvim-dap-virtual-text": { "branch": "master" },
  "nvim-lint": { "branch": "master" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-nio": { "branch": "master" },
  "nvim-paredit": { "branch": "master" },
  "nvim-paredit-fennel": { "branch": "master" },
  "nvim-paredit-scheme": { "branch": "master" },
  "nvim-parinfer": { "branch": "master" },
  "nvim-preview-csv": { "branch": "main" },
  "nvim-regexplainer": { "branch": "main" },
  "nvim-surround": { "branch": "main" },
  "nvim-treesitter": { "branch": "master" },
  "nvim-treesitter-endwise": { "branch": "master" },
  "nvim-treesitter-textobjects": { "branch": "master" },
  "nvim-ts-autotag": { "branch": "main" },
  "nvim-ts-context-commentstring": { "branch": "main" },
  "nvim-ufo": { "branch": "main" },
  "oceandeep": { "branch": "master" },
  "one-small-step-for-vimkind": { "branch": "main" },
  "onehalf": { "branch": "master" },
  "openscad.nvim": { "branch": "main" },
  "orgmode": { "branch": "master" },
  "otter.nvim": { "branch": "main" },
  "overseer.nvim": { "branch": "master" },
  "papercolor-theme": { "branch": "master" },
  "parpar.nvim": { "branch": "main" },
  "persistent-breakpoints.nvim": { "branch": "main" },
  "plenary.nvim": { "branch": "master" },
  "project.nvim": { "branch": "main" },
  "promise-async": { "branch": "main" },
  "quarto-nvim": { "branch": "main" },
  "quickfix-reflector.vim": { "branch": "master" },
  "rainbow-delimiters.nvim": { "branch": "master" },
  "range-highlight.nvim": { "branch": "master" },
  "refactoring.nvim": { "branch": "master" },
  "resolarized.nvim": { "branch": "master" },
  "rustaceanvim": { "branch": "master" },
  "space-vim-dark": { "branch": "master" },
  "spaceduck": { "branch": "main" },
  "srcery-vim": { "branch": "master" },
  "ssr.nvim": { "branch": "main" },
  "substitute.nvim": { "branch": "main" },
  "swhkd-vim": { "branch": "main" },
  "targets.vim": { "branch": "master" },
  "telescope-changes.nvim": { "branch": "master" },
  "telescope-ctags-outline.nvim": { "branch": "master" },
  "telescope-dap.nvim": { "branch": "master" },
  "telescope-fzf-native.nvim": { "branch": "main" },
  "telescope-repo.nvim": { "branch": "master" },
  "telescope-ui-select.nvim": { "branch": "master" },
  "telescope-undo.nvim": { "branch": "main" },
  "telescope.nvim": { "branch": "master" },
  "tempus-themes-vim": { "branch": "master" },
  "todo-comments.nvim": { "branch": "main" },
  "treesj": { "branch": "main" },
  "trouble.nvim": { "branch": "main" },
  "trusty_rusty_snippets": { "branch": "master" },
  "ts-comments.nvim": { "branch": "main" },
  "typst-preview.nvim": { "branch": "master" },
  "typst.vim": { "branch": "main" },
  "venv-selector.nvim": { "branch": "main" },
  "vim-AHKcomplete": { "branch": "master" },
  "vim-ReplaceWithRegister": { "branch": "master" },
  "vim-abolish": { "branch": "master" },
  "vim-asterisk": { "branch": "master" },
  "vim-auto-origami": { "branch": "master" },
  "vim-bbye": { "branch": "master" },
  "vim-better-whitespace": { "branch": "master" },
  "vim-characterize": { "branch": "master" },
  "vim-colors-github": { "branch": "master" },
  "vim-colors-pencil": { "branch": "master" },
  "vim-colors-violet": { "branch": "master" },
  "vim-colors-xcode": { "branch": "master" },
  "vim-conflicted": { "branch": "master" },
  "vim-cpp-enhanced-highlight": { "branch": "master" },
  "vim-dadbod": { "branch": "master" },
  "vim-dadbod-completion": { "branch": "master" },
  "vim-dadbod-ui": { "branch": "master" },
  "vim-dirvish": { "branch": "master" },
  "vim-dirvish-dovish": { "branch": "main" },
  "vim-dirvish-git": { "branch": "master" },
  "vim-dispatch": { "branch": "master" },
  "vim-dispatch-neovim": { "branch": "master" },
  "vim-doge": { "branch": "master" },
  "vim-eunuch": { "branch": "master" },
  "vim-fahrenheit": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-ghost": { "branch": "master" },
  "vim-git": { "branch": "master" },
  "vim-grepper": { "branch": "master" },
  "vim-indent-object": { "branch": "master" },
  "vim-indentwise": { "branch": "master" },
  "vim-lexical": { "branch": "master" },
  "vim-log-highlighting": { "branch": "master" },
  "vim-markdown-preview": { "branch": "master" },
  "vim-markology": { "branch": "master" },
  "vim-matchup": { "branch": "master" },
  "vim-misc": { "branch": "master" },
  "vim-mundo": { "branch": "master" },
  "vim-ninja-feet": { "branch": "master" },
  "vim-nix": { "branch": "master" },
  "vim-one": { "branch": "master" },
  "vim-polyglot": { "branch": "master" },
  "vim-relativize": { "branch": "master" },
  "vim-repeat": { "branch": "master" },
  "vim-rmarkdown": { "branch": "master" },
  "vim-session": { "branch": "master" },
  "vim-shell": { "branch": "master" },
  "vim-shortcut": { "branch": "master" },
  "vim-snippets": { "branch": "master" },
  "vim-startify": { "branch": "master" },
  "vim-startuptime": { "branch": "master" },
  "vim-stay": { "branch": "master" },
  "vim-sxhkdrc": { "branch": "master" },
  "vim-test": { "branch": "master" },
  "vim-texlog": { "branch": "master" },
  "vim-textobj-comment": { "branch": "master" },
  "vim-textobj-continuous-line": { "branch": "master" },
  "vim-textobj-entire": { "branch": "master" },
  "vim-textobj-fold": { "branch": "master" },
  "vim-textobj-markdown": { "branch": "master" },
  "vim-textobj-sentence": { "branch": "master" },
  "vim-textobj-user": { "branch": "master" },
  "vim-todo": { "branch": "master" },
  "vim-twiggy": { "branch": "master" },
  "vim-two-firewatch": { "branch": "master" },
  "vim-unimpaired": { "branch": "master" },
  "vim-unstack": { "branch": "master" },
  "vimtex": { "branch": "master" },
  "vinarise.vim": { "branch": "master" },
  "virtualsnip": { "branch": "master" },
  "vscode-neovim": { "branch": "master" },
  "vscode-openscad": { "branch": "master" },
  "vscode-python-snippet-pack-2.0": { "branch": "master" },
  "which-key.nvim": { "branch": "main" },
  "yanky.nvim": { "branch": "main" },
  "zoomwintab.vim": { "branch": "master" },
  "zoxide.vim": { "branch": "master" }
}
