murloccra4ler.leap
asvetliakov.vscode-neovim
bodil.file-browser
chrischinchilla.vscode-pandoc
frhtylcn.pythonsnippets
piotrgredowski.poor-mans-t-sql-formatter-pg
github.copilot
jacobdufault.fuzzy-search
kahole.magit
kevinrose.vsc-python-indent
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.live-server
nlehmann.vscode-vim-search-and-replace
randomfractalsinc.geo-data-viewer
reditorsupport.r
teabyii.ayu
vspacecode.vspacecode
vspacecode.whichkey
pokey.command-server
pokey.parse-tree
pokey.cursorless
pokey.talon
