AndreasArvidsson.andreas-talon
PaulSchaaf.talon-filetree
alefragnani.Bookmarks
asvetliakov.vscode-neovim
bodil.file-browser
charliermarsh.ruff
chrischinchilla.vscode-pandoc
detachhead.basedpyright
duniul.git-stage
frhtylcn.pythonsnippets
github.copilot
ignorantshr.git-commit-amend
jacobdufault.fuzzy-search
jeanp413.open-remote-ssh
jnoortheen.nix-ide
kahole.magit
kevinrose.vsc-python-indent
mrob95.vscode-talonscript
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.live-server
murloccra4ler.leap
njpwerner.autodocstring
nlehmann.vscode-vim-search-and-replace
piotrgredowski.poor-mans-t-sql-formatter-pg
pokey.command-server
pokey.cursorless
pokey.parse-tree
pokey.talon
quarto.quarto
randomfractalsinc.geo-data-viewer
reditorsupport.r
sleistner.vscode-fileutils
teabyii.ayu
usernamehw.errorlens
vspacecode.vspacecode
vspacecode.whichkey
