chenxsan.vscode-standardjs
codezombiech.gitignore
dbaeumer.vscode-eslint
dracula-theme.theme-dracula
eamodio.gitlens
Equinusocio.vsc-material-theme
formulahendry.auto-rename-tag
kisstkondoros.vscode-codemetrics
ms-vscode.theme-materialkit
Orta.vscode-jest
patrys.vscode-code-outline
pflannery.vscode-versionlens
PKief.material-icon-theme
redhat.java
robinbentley.sass-indented
streetsidesoftware.code-spell-checker
TimonVS.reactsnippetsstandard
vscjava.vscode-java-debug
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscodevim.vim
WallabyJs.quokka-vscode
wesbos.theme-cobalt2
